// Задача №1
// “Первый класс”
 
// 	Создайте класс, описывающий указанный в вашем варианте реальный объект. Не забывайте про принципы абстракции и инкапсуляции.
// В классе необходимо реализовать конструктор и деструктор (даже если они дефолтные). Класс разбейте на hpp и cpp файлы. Продемонстрируйте использование вашего класса.
	
// Квадрат, расчет площади, периметра и длины диагонали.
// Прямоугольник, расчет площади, периметра и длины диагонали.
// Куб, расчет площади, объема и длины диагонали.
// Прямоугольный параллелепипед, расчет площади, объема и длины диагонали.
// Сфера, расчет площади поверхности, объема.
// Треугольник, расчет площади, периметра.
// Параллелограмм, расчет площади, периметра.
// Эллипс, расчет площади, периметра.
// Правильный тетраэдр, расчет площади поверхности и объема.
// Конус, расчет площади поверхности, объема.
